Repository: 84000/data-translation-memory
Catalog: toh558-v1.tmx
Source language: bo
Languages: en

source: སྤུ་ཡི་བར་དང་གནད་རྣམས་དང་། །དེ་བཞིན་རྨ་ཡི་ཁ་རྣམས་སུ། །ལྷགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། །རིག་སྔགས་ཞགས་པས་རབ་ཏུ་དྲངས། །
en: “All those assembled Between body hairs, in the body’s vital spots, Or at the openings of wounds Are also brought forth by the noose incantation.

source: རི་ཡི་རྒྱལ་པོ་རི་རབ་དང་། །དེ་བཞིན་ཁོ་ར་ཁོར་ཡུག་དང་། །བྱ་རྒོད་ཕུང་པོ་གཤོལ་མདའ་འཛིན། །སྤོས་ངད་ལྡང་དང་གངས་ཀྱི་རི། །སྣ་ཚོགས་བརྩེགས་དང་པཎྜ་པཱ། །ན་ལ་པཱ་ཡི་རི་གཉིས་དང་། །དཔལ་གྱི་རི་ཡི་རྩེ་མོ་ནི། །གང་དག་ཤིན་ཏུ་མཐོར་འཕགས་དང་། །རི་བོ་དེ་དག་ཀུན་ལ་ཡང་། །ལྷ་དང་དྲང་སྲོང་གང་གནས་པ། །དེ་དག་ཐམས་ཅད་མི་དགའ་ཞིང་། །འཇིགས་པའི་ཡིད་ཀྱིས་མྱ་ངན་བྱེད། །
en: “Those that dwell on Sumeru, the king of mountains, And likewise on the surrounding mountain range, Those that dwell on Vulture Peak, Iśādhāra, Gandhamādana, and Himavat, “Those that dwell on Pāṇḍava, Citrakūṭa, And on the twin peaks of Nārada, Those on the peak of Śrīparvata, Risen to lofty summits, “All the gods and sages Dwelling on all those mountains Are displeased And cry out with anguish.

source: བྱེ་བ་སྟོང་གི་ལྷ་དག་དང་། །བྱེ་བ་ཕྲག་བརྒྱའི་ལྷ་རྣམས་དང་། །ལྷ་ཡི་བུ་མོ་སྐལ་ཆེན་དག །ཐལ་མོ་རབ་ཏུ་སྦྱོར་བར་བྱེད། །
en: “Billions of gods And trillions of gods With fortunate, divine maidens Join their palms.

source: ཐགས་བཟངས་རིས་དང་སྒྲ་གཅན་དང་། །སིམ་པར་བྱེད་པའང་དེར་ཕྱིན་ཏོ། །
en: “Vemacitrin, Rāhula, And Prahlāda have also assembled;

source: ལྷ་མིན་བྱེ་བ་ཕྲག་སྟོང་དང་། །ལྷ་མིན་བྱེ་བ་ཕྲག་བརྒྱ་དང་། །དེ་དག་བུ་མོ་འཕྲུལ་ལྡན་པ། །མང་པོ་ཀུན་ཀྱང་ཐལ་མོ་སྦྱོར། །
en: The trillions of asuras And billions of asuras, Along with their many daughters with supernatural powers, All join their palms.

source: རབ་ཏུ་གནས་དང་རྒྱ་མཚོ་དང་། །ཀླུ་ཡི་རྒྱལ་པོ་གཟི་ཅན་དང་། །ཀླུ་ཡི་རྒྱལ་པོ་མ་དྲོས་དང་། །དགའ་བོ་ཉེ་དགའ་གཉིས་པོ་དང་། །རྡོ་རྗེ་བློ་གྲོས་པཀྴུ་དང་། །གངྒཱ་དགའ་བོ་སིན་དྷུ་མཚོ། །བྱ་ཡི་རྒྱལ་པོ་འདབ་བཟངས་དང་། །རྒྱ་མཚོ་ཆེན་པོ་འཁྲུག་བྱེད་དང་། །སྟོང་ཕྲག་བྱེ་བའི་ཀླུ་ཡི་རྣམས། །བྱེ་བ་བརྒྱ་ཡི་ཀླུ་དག་དང་། །དེ་དག་བུ་མོ་སྐལ་ཆེན་རྣམས། །ཐལ་མོ་རབ་ཏུ་སྦྱོར་བར་བྱེད། །
en: “Supratiṣṭha, Sāgara, And the nāga king Manasvin, The nāga king Anavatapta, And the pair Nanda and Upanandaka, “Vajramati, Vakṣunanda, Gaṅgā, Nanda, Sindhu, Sāgara, And Suparṇī, king of birds— “Who with millions And billions of nāgas Churn up the ocean— They and their fortunate daughters Join their palms.

source: ཉི་མ་ཟླ་བ་གཉིས་ཀ་ཡང་། །སྐར་མའི་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར། །
en: “Even the sun and the moon, Surrounded by the stars,

source: གསེར་གྱི་མེ་ཏོག་ཡན་ལག་ན། །མ་ག་དྷཱ་ན་འཇིགས་བྱེད་པ། །གསོ་བའི་མཐའ་ན་མི་ཐོད་ཅན། །ཀོ་ས་ལ་ན་རབ་ཏུ་དཀར། །བཟང་པོའི་ཡུལ་ན་ཁ་སྤུ་ཅན། །གྱད་ཀྱི་ཡུལ་ན་གྲགས་པ་འཛིན། །ལྔ་འཛིན་པ་ན་སྐྲག་བྱེད་པ། །རྟ་སྐྱེ་བ་ན་མིག་དམར་གནས། །སྲུང་བྱེད་པ་ན་སེར་སྐྱ་སྟེ། །སེམས་པ་ན་ནི་མིག་སེར་པོ། །བེའུ་ལ་ཕན་བུམ་པའི་ལྟོ། །
en: Suvarṇavarṇa in Puṣpa, Rabheyaka in Magadha, Kāpili in Bharukaccha, Prapuṇḍaka in Kośala, “Śūcīlomā in Bhadra, Yaśodharā in Malla, Vibhīṣaṇa in Pāñcāla, And Lohitākṣa in Aśvaja, “Piṅgala in Avanta, Kapilākṣa in Vaidiśa, Kumbhodara in Matsa, And Dīrghila in Sūrata,

source: དགའ་བའི་ཡུལ་ན་རིང་པོར་སྐྱེས། །བ་ལང་འཛིན་ན་རབ་ཏུ་འཇོམས། །དུང་ཡུལ་ན་ནི་ཉི་མའི་གྲོགས། །ལྗོངས་ཆེན་རྣམས་ཀྱི་གནོད་སྦྱིན་ནི། །བརྗོད་པ་བཅུ་དྲུག་དེ་དག་དང་། །
en: And Dīrghila in Sūrata,

source: ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་ཆེ། །ཆོས་སྐྱོང་རབ་ཏུ་དཀར་བ་དང་། །སེར་སྐྱ་རབ་མཛེས་ཁྱབ་འཇུག་པ། །བུམ་ལྟོ་གསུས་པ་ཟླུམ་པོ་དང་། །ཆུ་སྲིན་བདེན་པ་འཆང་བ་དང་། །ལྔ་ལྡན་རྒྱལ་བ་ཁྱུ་མཆོག་དང་། །གནོད་སྦྱིན་ཆེན་པོ་དབང་ཕྱུག་ཆེ། །ལག་པ་བཞི་ཅན་སྟོབས་པོ་ཆེ། །སྡེ་པ་རབ་ཏུ་འདུལ་བ་ནི། །མཐུ་བོ་ཆེ་ལ་སྟོབས་པོ་ཆེ། །གཤིན་རྗེ་གཤིན་རྗེའི་ཕོ་ཉ་དང་། །བདུད་རྣམས་སྡེ་དང་བཅས་པ་དང་། །གནོད་སྦྱིན་བྱེ་བའི་གཡོག་འཆང་བ། །གནོད་སྦྱིན་དེ་མིང་འཕྲོག་པོ་ཡིན། །
en: “The great yakṣa Vajrapāṇi, The Dharma protector Prapuṇḍara, Kapila, Sudarśana, Viṣṇu, Piṇḍāra, and Karaśodara, “Kumbhīra, Sātyaki, Pāñcika, and Jinarṣabha, The great yakṣa Maheśvara, Four armed and mighty, “Pramardana Śūrasena, Powerful and mighty, Yama and his servants, And Māra with his army, “The yakṣa named Hari Retaining an entourage of ten million yakṣas,

source: ཤ་རི་ཏ་ནི་སྡེར་བཅས་དང་། །རི་ཡི་བུ་མོ་སྡེར་བཅས་དང་། །རི་ཡི་བུ་མོ་གནོད་སྦྱིན་མ། །གཟི་བརྗིད་ཆེན་པོ་འཇིགས་པའི་གཟུགས། །འཕྲོག་མ་ཞེས་ཀྱང་གྲགས་པ་དང་། །གདོལ་པ་མོ་ནི་གཏུམ་མོ་དང་། །བུ་རྣམས་ལྔ་བརྒྱས་བསྐོར་བ་དང་། །མི་རྡུང་ནག་མོ་ཀར་ཀ་ཏེ། །པདྨ་དང་ནི་པདྨ་ཅན། །མེ་ཏོག་སོ་དང་ས་ག་དང་། །སྲིན་མོ་བོང་བུའི་རྣ་ཅན་དང་། །ཙནྡན་དང་ནི་ཁྱབ་འཇུག་ལེན། །སེང་གེ་སེར་སྐྱ་དམར་སེར་པོ། །གླང་པོ་ཀླུ་ཡི་སོ་ཅན་དང་། །རི་བཤེས་དྲག་པོའི་མཆེ་བ་ཅན། །སྲིན་མོ་སོ་བཟང་ཡོད་པ་དང་། །ཚངས་པ་ལེན་དང་ཁྱབ་འཇུག་ལེན། །གནོད་སྦྱིན་ཧ་ལ་ཧ་ལ་དང་། །གནོད་སྦྱིན་རྣམ་པའི་མཆུ་ཅན་དག །
en: Śarita with her army, And the yakṣiṇī Giridāri With her army, “The majestic, terrific form Known as Hārītī, And Caṇḍā Caṇḍālikā Surrounded by her five hundred sons, “Ākoṭā, Karkaṭī, Kālī, Padumā, Padumāvatī, Puṣpadantī, Viśālā, And the rākṣasī Kharakarṇa, “Candana, Viṣṇula, Haripiṅgalapiṅgala, Kuñjara, Nāgadanta, Girimitra, and Agradaṃṣṭraka, “The rākṣasī Bhadradantā, Brahmilā, Viṣṇulā, The yakṣa Hālāhala, And the rākṣasa Vituṇḍaka—

source: མདུང་དང་མདའ་གཞུ་ཀུན་ཐོགས་ཤིང་། །མི་རྟ་བ་ལང་རི་དགས་རྣམས། །ཟ་ཞིང་འཚེ་བ་དེ་དག་ནི། །ཕྱོགས་རྣམས་ཀུན་ཏུ་རྒྱུག་ཅིང་འདོང་། །
en: “Carrying spears, bows, and arrows, They run around everywhere, Harming and devouring People, horses, cows, and deer.

source: ས་འདི་རབ་ཏུ་གཡོ་བར་བྱེད། །ནགས་ཚལ་རྣམས་ཀྱང་རབ་ཏུ་སྐེམས། །རི་རྣམས་ཀུན་ནས་གཡོ་བར་བྱེད། །སྐྱེ་དགུ་འདི་དག་འཚེ་བྱེད་ཅིང་། །
en: “Shaking the earth, They dry up the groves; Shaking the mountains, They harm these beings.

source: ཕན་ཚུན་ནས་ནི་འདུ་བ་དག །རིག་སྔགས་ཀྱིས་ནི་དྲངས་ནས་ལྷགས། །
en: “Assembling from far and near, They converged, summoned by the incantation.

source: འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔ་རུ། །དེ་དག་ལྷགས་པར་གྱུར་པ་དང་། །དེ་ནས་རྒྱལ་པོ་རྣམ་ཐོས་བུས། །འཇིག་རྟེན་མགོན་ལ་འདི་སྐད་གསོལ། །
en: When they had thus assembled Before the Lord of the World, King Vaiśravaṇa then said this To the Lord of the World:

source: བདག་གི་ཕྱོགས་ཆ་བྱང་ཕྱོགས་སུ། །རྒྱལ་པོའི་གནས་སུ་སྤྲུལ་པ་ནི། །ལྕང་ལོར་ལྡན་པ་ཡིད་དུ་མཆི། །དེ་བས་བདག་ནི་ལྕང་ལོའི་བདག །
en: “The royal palace manifested To the north of me Is beautiful Aḍakavatī; Thus I am its lord.

source: རྒྱལ་པོའི་ཕོ་བྲང་ལྕང་ལོ་ཅན། །ལྷ་རྣམས་ཀུན་གྱིས་བསམ་པར་གྱུར། །
en: All the gods marvel over The royal palace of Aḍakavatī.

source: ཕྱི་ར་ཤིན་ཏུ་མཐོན་པོ་ཅན། །རིན་ཆེན་ཀུན་གྱིས་བརྒྱན་པ་ལགས། །འཕང་དུ་དཔག་ཚད་བཅུ་དྲུག་སྟེ། །གསེར་གྱི་རྒྱུ་ལས་བགྱིས་པ་ལགས། །ཕྱོགས་བཞི་ལྕོག་ནི་རེ་རེ་ལའང་། །གནོད་སྦྱིན་རྡོ་རྗེ་འཆང་བ་དག །ཀུན་ནས་རབ་ཏུ་གནས་པར་གྱུར། །ལག་ན་མཚོན་ཆ་ལེགས་པར་སྤྲུལ། །
en: “Its high surrounding wall Is studded with all precious materials. It is sixteen leagues in height And made out of gold. “Each of its four directional turrets Is inhabited all around By vajra-holding yakṣas, With weapons manifested in their hands.

source: རྒྱལ་བོའི་ཕོ་བྲང་དེ་ཡི་སྒོ། །བཞི་པོ་གཏོད་པར་བགྱིས་པ་ནི། །གཅིག་ནི་གསེར་ལས་བགྱིས་པའི་སྒོ། །གཉིས་པ་དངུལ་ལས་བགྱིས་པ་སྟེ། །གསུམ་པ་ཤེལ་གྱི་སྒོ་མོ་ལགས། །བཞི་པ་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: “The royal palace Is equipped with four gates: The first gate is made of gold. The second is made of silver. “The third is a crystal gate. The fourth is adorned with gold.

source: གྲོང་ཁྱེར་དེ་ཡི་ནང་དག་ན། །སྐྱེད་མོས་ཚལ་གྱི་མེ་ཏོག་རྒྱས། །
en: Inside the city Is a garden with flowers in full bloom.

source: དེ་ཡི་ནང་ན་གཞལ་མེད་ཁང་། །རིན་ཆེན་བདུན་རྒྱུ་སྣ་ཚོགས་མཆིས། །རིན་ཆེན་སྣ་ཚོགས་ལྗོན་ཤིང་ཅན། །བྱ་བྲན་སྣ་ཚོགས་སྐད་ཀྱང་འབྱིན། །
en: “Inside the city are various mansions Made of the seven types of precious substances, With trees of various jewels, And the symphonic warbling of birds.

source: མེ་ཏོག་སྣ་ཚོགས་ལེགས་པར་བཀྲམ། །སྣ་ཚོགས་སྤོས་ཀྱིས་བྱུགས་པ་ལགས། །
en: “It is strewn with various flowers And anointed with various perfumes.

source: གནོད་སྦྱིན་མོ་ནི་འཇོམས་མ་དང་། །གླུ་དང་རོལ་མོས་རབ་ཏུ་བརྒྱན། །
en: It is adorned with the yakṣiṇī Vidhvaṃsaṇī And with song and music.

source: དཔལ་གྱི་དམ་པ་ཉམས་སུ་མྱོང་། །དེར་ནི་འབྱུང་པོའི་དཀྱིལ་འཁོར་དེར། །གང་དག་འཁོར་ཞིང་མཆིས་པ་དག །རྣམ་པའི་མཆོག་ཀུན་ལྡན་པ་སྟེ། །
en: “I experience the most sublime happiness There, in that circle of bhūtas. My attendants there, moreover, Are endowed with all the best attributes.

source: ཆོས་འཚལ་བ་དང་ཆོས་སྤྱོད་པ། །སྲོག་ཆགས་རྣམས་ལ་འཚེ་མི་བགྱིད། །
en: “As beings that seek the Dharma and practice the Dharma, They do not harm creatures.

source: ཟས་དང་སྐོམ་གྱིས་མི་བྲེལ་ཏེ། །སྐྱེ་དགུ་མི་བཟད་གཞན་དག་ནི། །ལོངས་སྤྱོད་ཆེན་པོ་ཚོལ་བགྱིད་ཅིང་། །ཕྱོགས་བཞི་ཀུན་ཏུ་རྣམ་པར་ལྟ། །
en: “Deprived of food and drink, Other dreadful beings Search about for the best sense pleasures, And look everywhere throughout the four directions.

source: གྲོང་ཁྱེར་སྒོ་ཡི་གོམ་ཡོ་དང་། །བཟའ་ཤིང་ར་བ་ནགས་ཚལ་ན། །གནོད་སྦྱིན་སྲིན་པོ་འབྱུང་པོའི་ཚོགས། །བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་མཆིས་པ། །དེ་དག་ཐམས་ཅད་མདོ་སྡེ་ཡི། །ཞགས་པས་དྲངས་ཏེ་བརླག་པར་བགྱི། །
en: “I will destroy All of those hundreds of billions Of yakṣas, rākṣasas, and bhūtas That dwell at the city gates, In gardens and forests, Summoning them with the sūtra noose!

source: རྒྱལ་པོའི་ཕོ་བྲང་དབུས་ན་ནི། །ཆོས་ཀྱི་རྒྱལ་པོའི་གནས་གྱུར་པ། །བསིལ་བའི་རྫིང་བུས་བསྐོར་བ་སྟེ། །ཙནྡན་ནགས་ཀྱིས་འཁོར་བ་ལགས། །
en: “At the center of the royal palace Is the dwelling place of the Dharma King, Encircled by a cool pond And shaded by sandal trees.

source: ཀུན་ནས་དཔག་ཚད་དྲུག་ཅུ་སྟེ། །ཁང་པ་བརྩེགས་མ་སྤྲུལ་པ་དག །
en: “All around, for sixteen leagues, Mansions are formed.

source: གཅིག་ནི་གསེར་ལས་བགྱིས་པ་སྟེ། །གཉིས་པ་དངུལ་ལས་བགྱིས་པ་ལགས། །གསུམ་པ་བཻཌཱུརྱ་ལས་བགྱིས། །བཞི་པ་གཙང་དང་ཤེལ་གྱི་རྒྱུ། །ལྔ་པ་མུ་ཏིག་དམར་པོ་སྟེ། །དྲུག་པ་རྡོ་ཡི་སྙིང་པོ་ལགས། །བདུན་པ་སྤུག་ལས་བགྱིས་པ་སྟེ། །བརྒྱད་པ་རིན་ཆེན་བདུན་ལས་བགྱིས། །
en: The first is made of gold. The second is made of silver. “The third is made of beryl. The fourth is made of pure crystal. The fifth is made of red pearl. The sixth is made of emerald. The seventh is made of ruby. The eighth is made of all seven precious substances.

source: བུད་མེད་སྟོང་ཕྲག་བརྒྱ་དག་ཀྱང་། །དེ་དག་རེ་རེ་ཀུན་ན་གནས། །ལྷབ་ལྷུབ་སྣ་ཚོགས་མཆོག་དག་དང་། །ཆ་བྱད་སྣ་ཚོགས་མང་པོས་བརྒྱན། །
en: “Hundreds of thousands of women Adorned with many various pieces of jewelry And garments Inhabit each one of them.

source: གླུ་དང་རོལ་མོ་སྣ་ཚོགས་དང་། །བཟོ་ཡི་གནས་ལ་མཁས་པ་མཆིས། །
en: “They are learned in singing and playing musical instruments And in artistic skills.

source: དེ་ལྟའི་རབ་ཏུ་དགའ་བ་ཡིས། །བདེ་ཞིང་ཚིམ་པའི་ཡིད་གྱུར་ཅིང་། །
en: Enthralled and satiated With such delights,

source: དེ་ན་བདག་ནི་དགུན་སྐྱེམས་དང་། །འདོད་པ་དག་གིས་རབ་མྱོས་པས། །བདག་གི་འཁོར་རྣམས་འཕྱན་བགྱིད་ཅིང་། །ཕྱོགས་བཅུ་དག་ཏུ་འཇིགས་པ་སྐྱེད། །
en: “I am intoxicated there With sweet drink and pleasures. Thus, my attendants wander off And wreak havoc throughout the ten directions.

source: བུད་མེད་དག་དང་སྐྱེས་པ་དང་། །དེ་བཞིན་ཁྱེའུ་དང་བུ་མོ་དང་། །མངལ་ན་གནས་པའང་འཇིགས་པར་བགྱིད། །དུད་འགྲོའི་སྐྱེ་གནས་གཏོགས་པའང་འཚེ། །
en: “Women and men, And likewise boys and girls, And infants in the womb are terrorized. Those in the animal realms are also harmed.

source: སྐར་མ་དག་དང་ཉི་ཟླ་དང་། །གཏུམ་པའི་གཟའ་རྣམས་གནོད་པར་བགྱིད། །
en: “The stars, the sun, and the moon, And the terrible planets are harmed.

source: ལོ་ཏོག་ས་བོན་འབྲས་བུ་དང་། །མེ་ཏོག་སྨན་དང་ཟས་སྐོམ་དང་། །མི་རྣམས་ཀྱི་ནི་དཔལ་འཕྲོག་ཅིང་། །མཐོན་པོ་རྣམས་ཀྱང་དམའ་བར་བགྱིད། །
en: They steal grain, seeds, and fruit, Flowers, medicine, food, and drink. “Stealing the splendor of human beings, They make high beings low.

source: འཇིག་རྟེན་དག་ན་ནོངས་པ་རྣམས། །དམག་དང་འཐབ་མོ་ཤར་གཉེར་དང་། །ཚིག་གམ་ཞིག་གམ་གསད་ཕྱེ་བ། །དེ་ཀུན་འབྱུང་པོའི་རྣམ་པར་གྱུར། །
en: “Whatever wars, fights, and strife There are in the world, All that is scorched, destroyed, slain, or split Is an expression of bhūtas.

source: སྦེད་ཅིང་སྟོན་པར་བགྱིད་པ་དང་། །བཟློག་པར་བགྱིད་ཅིང་རྒོད་པར་བགྱིད། །འཇིགས་པར་བགྱིད་ཅིང་ལྟ་བར་བགྱིད། །དགྲར་འགྱུར་བ་ཡང་སྟོན་པར་བགྱིད། །སྡིག་པའི་རྨི་ལམ་མཐོང་བར་བགྱིད། །ཉལ་བ་དག་ལ་གནོད་པར་བགྱིད། །
en: “They conceal and reveal, Turn back and confront, Frighten and seek out, And show hostility. “They cause nightmares And cause harm to the slumbering.

source: སྒོ་ནས་སེ་གོལ་སྒྲ་ཕྱུང་ཞིང་། །མི་སྙན་བརྗོད་དེ་ཟ་བར་བགྱིད། །
en: Projecting clicking sounds from doorways, They screech and devour.

source: མཛའ་བོ་གཉེན་བཤེས་གཟུགས་དག་ཏུ། །གདའ་ཞིང་བཀའ་མཆིད་སྨྲ་བར་བགྱིད། །
en: “They appear in the form of friends and relatives And begin conversation.

source: བུ་མོ་སྡུག་གུའི་གཟུགས་དག་ཏུ། །འདོད་ལ་སྤྱོད་པ་དགའ་བར་བགྱིད། །
en: They appear in the form of beautiful girls And indulge their desires.

source: ཉི་མ་སྐར་མའི་གཟུགས་དང་ནི། །ཟླ་བའི་གཟུགས་སུ་གདའ་བར་བགྱིད། །
en: “They appear in the form of the sun and stars, And in the form of the moon.

source: རླུང་དང་སྐར་མདའ་ལྕེ་གཟུགས་སུ། །ཚེ་ལ་གནོད་པར་དེ་དག་གདའ། །
en: Those detrimental to life Appear in the form of wind and shooting stars.

source: སྐར་མའི་ཚོགས་དང་འདྲ་བ་དག །འཇིགས་པར་བགྱིད་པ་ཝ་དང་ཁྱིར། །རྣམ་པར་སྤྲུལ་ནས་ལྗོན་ཤིང་དང་། །མཆོད་རྟེན་དག་གི་གནས་ན་གདའ། །
en: “They appear as frightening jackals and dogs, As many as the host of stars, At the locales of trees And shrines.

source: སྐྱེས་པ་གཞོན་ནུའི་གཟུགས་མཛེས་པ། །འབར་ཞིང་ཤིང་རྟའི་སྒྲ་ཡང་འབྱིན། །
en: “In the beautiful form of young men, They shine and make the sounds of carriages.

source: གནས་རྣམས་དང་ནི་ཤུལ་དག་ཏུ། །རྣམ་པ་སྣ་ཚོགས་རྗེས་ཀྱང་སྟོན། །
en: At locations and on roads They manifest various forms.

source: གྲོང་ཁྱེར་དག་དང་ཁྱིམ་རྣམས་ཀྱི། །སྒོ་ཡང་གནོད་སྦྱིན་དེ་དག་འབྱེད། །
en: These yakṣas open the entrances To cities and homes.

source: སྲོག་དང་ལུས་ཀྱང་བླངས་བགྱིས་ཤིང་། །ལམ་ངན་ཀུན་ཏུ་སྐོར་བར་བགྱིད། །
en: “Seizing life force and body, They gravitate toward bad pathways.

source: རྣམ་པ་སྣ་ཚོགས་གཟུགས་དག་དང་། །རྣམ་པ་སྣ་ཚོགས་སྒྲ་རྣམས་དང་། །རྣམ་པ་སྣ་ཚོགས་ནད་ཀྱིས་རྣམས། །ལུས་ལ་ན་བ་གནས་པར་སྟོན། །
en: “In various forms, With various sounds And various diseases, They manifest illnesses in the body.

source: ནད་རྣམས་ཀུན་གྱི་མཚན་ཉིད་ཀྱང་། །ཕྱིན་ཅི་ལོག་ཏུ་སྟོན་པར་བགྱིད། །
en: They falsely present the symptoms Of all diseases.

source: ཇི་སྙེད་འཇིག་རྟེན་རང་བཞིན་དག །ཐམས་ཅད་ལོག་པར་དེ་དག་སྟོན། །
en: “They distort everything— The nature of all that appears in the world Is twisted by them.

source: རིག་སྔགས་ཞགས་པས་དྲངས་པས་ན། །དེ་དག་ཀུན་ཀྱང་འདིར་མཆིས་སོ། །
en: Led forth by the sūtra noose, They are all present here.”

source: དེ་ནས་རྒྱལ་པོ་རྣམ་ཐོས་བུ། །ལངས་ཏེ་ཐལ་མོ་རབ་སྦྱར་ནས། །
en: Then, Vaiśravaṇa arose, And with palms joined said:

source: ཞབས་ལ་འཁོར་ལོའི་མཚན་མངའ་བ། །གསེར་གྱི་མཆོད་སྡོང་འབར་བ་བཞིན། །འཇིག་རྟེན་སྣང་བར་མཛད་པ་པོ། །ཐུབ་པ་ཆེན་པོ་མེ་དང་འདྲ། །
en: “You with designs of wheels on your feet, You are like a shining golden sacrificial post. Illuminator of the world, Great Sage, you are like fire!

source: གནོད་སྦྱིན་གསང་སྔགས་མི་བཟད་ཅན། །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་དག །བྱང་གི་ཕྱོགས་ཆའི་ཕྱོགས་ན་གནས། །བྱང་ཕྱོགས་དག་ཏུ་གནོད་པར་བགྱི། །
en: “Sixty-four thousand yakṣas With terrible secret mantras Dwell in the north And perpetrate harm in the north.

source: འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་ནི། །དེ་དག་ཆད་པ་བདག་གིས་བཤད། །
en: “In the presence of the Lord of the World, I will pronounce their punishment:

source: སྱཱད་ཡ་ཐེ་ད་ན། ཁངྒེ། ཁངྒེ། ཁངྒ། གམྦྷེ། པི་ཙཀྵ་ཎེ་ཙཀྲ། རཱ་ཛ་ནེ། ཙནྡྲེ། ཙ་པ་ལེ། པཱ་ཏཱ་ལེ། བྷཱི་མ་བ་ད་བ་ཏི། ཁ་རཱ་གྲེ་བྷྲྀ་ཀུ་ཊི་མུ་ཁེ་ཀུ་ཊི་ལ་ཀ་རཱ་གྲེ། ཨེ་ཀཱ་ཀྵི། པ་ར་ག་བ་ཏི། སཱ་རཾ་ག་བ་ཏི། མཱརྒ་བ་ཏི། གརྒ་བ་ཏེ། ཙི་ཏྲ་བ་ཏི། ཙི་ཏྲ་ཀཱནྟི། བདག་བྱང་ཕྱོགས་སུ་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: syād yathedam khaṅge khaṅge khaṅga garbhe vicakṣaṇe cakra rājane candre capale pātāle bhīmavadavati kharāgre bhṛikuṭimukhe kuṭila­karāgre ekākṣi vargavati sāraṅgavati mārgavati gargavate citravati citrakānti | “ May I have well-being in the north! Svāha

source: ཚངས་པ་དང་ནི་བརྒྱ་བྱིན་དང་། །འཇིག་རྟེན་སྐྱོང་དང་དབང་ཕྱུག་ཆེ། །གནོད་སྦྱིན་སྡེ་དཔོན་ཐམས་ཅད་དང་། །འཕྲོག་མ་བུ་དང་བཅས་པ་ཡང་། །བདག་གི་མེ་ཏོག་སྤོས་དག་དང་། །སྦྱིན་སྲེག་འདི་ནི་བླང་བར་གྱིས། །
en: “May Brahmā and Śakra, The guardians of the world and Maheśvara, All the yakṣa generals, And Hārītī with her sons Accept from me these flowers, incense, And burnt offerings!

source: དེ་དག་གི་ནི་བརྩོན་འགྲུས་དང་། །གཟི་བརྗིད་དབང་ཕྱུག་སྟོབས་ཀྱིས་ཀྱང་། །
en: “Through their vigor, Brilliance, majesty, and might,

source: ནད་རྣམས་ཐམས་ཅད་བཅོམ་པར་གྱུར། །
en: May all illnesses be vanquished

source: དེ་དག་གི་ནི་བརྩོན་འགྲུས་དང་། །གཟི་བརྗིད་དབང་ཕྱུག་སྟོབས་ཀྱིས་ཀྱང་། །ནད་རྣམས་ཐམས་ཅད་བཅོམ་པར་གྱུར། །
en: “Through their vigor, Brilliance, majesty, and might, May all illnesses be vanquished

source: བདག་འཇིགས་པ་དང་གནོད་པ་ཐམས་ཅད་ལས་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: And may I be safe From all perils and misfortunes!

source: རྒྱལ་ཆེན་ཡུལ་འཁོར་སྲུང་བ་ཡང་། །ལངས་ཏེ་ཐལ་མོ་སྦྱར་བཏུད་ནས། །
en: The great king Dhṛtarāṣṭra arose, And with palms joined said:

source: མེ་ཏོག་ཚོགས་ལྟར་རྒྱས་གྱུར་ཅིང་། །
en: “You who are in full bloom, like a bouquet of flowers,

source: ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་ཅན། །ཁུ་བྱུག་དང་ནི་རྨ་བྱའི་སྒྲ། །
en: You with the voice of a kalaviṅka bird’s call, Who resound with the sound like that of kokila birds and peacocks,

source: རྔ་དང་འབྲུག་གི་སྒྲ་སྒྲོགས་པ། །
en: And like the roar of kettledrums and thunder,

source: ཐུབ་ཆེན་གནོད་སྦྱིན་སྲིན་པོ་དང་། །དྲི་ཟ་སྟོང་ཕྲག་དྲུག་ཅུ་བཞི། །ཤར་གྱི་ཕྱོགས་ཆའི་ཕྱོགས་ན་གནས། །ཤར་ཕྱོགས་པ་ལ་གནོད་པར་བྱེད། །
en: “Great Sage, Sixty-four thousand yakṣas, rākṣasas, and gandharvas Dwell in the east And perpetrate harm in the east.

source: འཇིག་རྟེན་མགོན་གྱི་སྤྱན་སྔར་ནི། །དེ་དག་ཆད་པ་བདག་གིས་བཤད། །
en: “In the presence of the Lord of the World I will pronounce their punishment:

source: སྱཱད་ཡ་ཐེ་དན། དྷཱ་ར་ཎི། དྷཱ་ར་ཎི། པྲ་དྷྭན་ས་ནི། བྷཉྫ་ནི། པྲ་བྷཉྫ་ནི། བི་དྷ་མ་ནི། །ཀིམ་པུ་རུ་ཥེ། ཤ་ཀ་ལེ། སཱ་རེ་ཐེ། སཱ་ར་བ་ཏི། ཤཱུ་ལ་དྷ་རེ། །ཤཱུ་ལ་དྷཱ་རི་ཎི། ཤུད་དྷ་ཙ་ར་ཎེ། གྷོ་ཥ་བ་ཏི། ཤཱ་རཱ་གྲེ །ཤཱནྟེ། བདག་ཤར་ཕྱོགས་སུ་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: syād yathedam dhāraṇi dhāraṇi pradhvaṃsani bhañjani prabhañjani vidhamaṇi kiṃpuruṣe śakale sārethe sāravati śūladhare śūladhāriṇi śuddhacaraṇe ghoṣavati śārāgre śānte | “ May I have well-being in the east! Svāha

source: རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ། །ཐལ་མོ་སྦྱར་ཏེ་དེ་ནས་ལངས། །
en: King Virūḍhaka then arose, And with palms joined said:

source: ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས། །སྨྲ་བ་ཐམས་ཅད་རབ་འཇོམས་པ། །ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་མཛད་པ། །འཇིག་རྟེན་ཐམས་ཅད་རྣམ་འདྲེན་པ། །
en: “All-knower, all-seer, Defeater of all proponents, Dispeller of all doubts, Leader of all worlds,

source: གྲུལ་བུམ་ཡི་དགས་སྲུལ་པོ་དག །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་རྣམས། །ལྷོ་ཡི་ཕྱོགས་ཆའི་ཕྱོགས་ན་གནས། །དེ་ནས་བྱུང་ལ་གནོད་པར་བགྱིད། །
en: “Sixty-four thousand Kumbhāṇḍa pretapūtanas Dwell in the south And perpetrate harm Against those who appear there.

source: འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་ནི། །དེ་དག་ཆད་པ་བདག་གིས་བཤད།
en: “In the presence of the Lord of the World, I will pronounce their punishment:

source: སྱཱད་ཡ་ཐེ་དན། ཤཱནྟི། ཤཱ་ར་བ་ཏི། ཀཱནྟི། ཀཱ་ར་བ་ཏི། ཀིཾ་ཀ་ར་སི། ཀིཾ་ཀ་ར་ཏི། ཀིཾ་ཀ་སི་ཀི་རིཎྚི། ཀིཾ་ར་ཏེ། ཀིཾ་བ་ཏེ། དྷ་ར་ཎི། དྷ་བ་ནི། བྷཱུ་མི། དྷཱ་རྀ་ཎི། ཧི་མ་བ་ཏི། ཛྱོ་ཏིཥྩ་ར་ཎེ། གཱ་ལཱ་གྲེ། བདག་ལྷོ་ཕྱོགས་སུ་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: syād yathedam śānti śāravati kānti kāravati kiṃkarasi kiṃkarati kiṃkasikiriṇṭi kiṃrate kiṃvate dharaṇi dhavani bhūmi dhāriṇi himavati jyotiścaraṇe gālāgre | “ May I have well-being in the south! Svāha

source: བདག་འཇིགས་པ་ཐམས་ཅད་དང་གནོད་པ་ཐམས་ཅད་ལས་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: And may I be safe From all perils and misfortunes!

source: ཕྱག་འཚལ་སྐྱེས་བུ་དཔའ་ཁྱོད་ལ། །ཕྱག་འཚལ་སྐྱེས་བུ་མཆོག་ཁྱོད་ལ། །ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ལོ། །ཆོས་རྒྱལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to you, heroic being! Homage to you, supreme being! We pay homage with palms joined! Homage to you, king of Dharma!”

source: རྒྱལ་པོ་མིག་མི་བཟང་བ་ཡང་། །ཐལ་མོ་སྦྱར་བ་བྱས་ནས་ལངས། །
en: King Virūpākṣa then arose, And with palms joined said:

source: སྤྲིན་ཆེན་སེང་གེ་ཆེན་པོ་པ། །ཆེ་བའི་ཆེ་བ་རྒྱ་མཚོ་ཆེ། །གསུང་བ་ཆེན་པོ་དཔའ་ཆེན་པོ། །གཡུལ་ཆེན་རབ་ཏུ་འཇོམས་མཛད་པ། །
en: “Great Cloud, Great Lion, Greatest of the Great, Great Ocean, Great Proponent, Great Hero, Vanquisher of Great Armies,

source: ཀླུ་དང་འདབ་བཟངས་གསང་བ་པོ། །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་དག །ནུབ་ཀྱི་ཕྱོགས་ཆའི་ཕྱོགས་ན་གནས། །དེ་ནས་བྱུང་ལ་གནོད་པར་བགྱིད། །
en: “Sixty-four thousand Fine-winged nāga guhyakas Dwell in the west And perpetrate harm against those who appear there.

source: སྱཱད་ཡ་ཐེ་ད་ན། དྷརྨྨི་བ་ར་གྲེ། བ་ལ་བ་ཏེ། བ་ལི་ནི། བི་ཤཱཾ་གེ། བི་ཙ་ཤི། སཱ་ག་རེ། ཁཱ་རཱི། ཀ་བ་ལི། ཙཎྜ་ལི། ཀི་རི་ཎི། ནཱི་ར་ཉྫ་ནེ། བིངྷཱར་ཎི། བལླ་མ་ཏི། ཨ་བརྞ་བ་ཏེ། ཨ་ཙ་ལེ། བདག་ནུབ་ཕྱོགས་སུ་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: syād yathedam dharmivarāgre balavate balini viśāṅge vicaśi sāgare khārī kapali caṇḍāli kiriṇi nīrañjane vidhāriṇi vallamati avarṇavati acale | “ May I have well-being in the west! Svāha

source: དེ་ནས་ཚངས་པ་ཚངས་ཆེན་ཡང་། །ཐལ་མོ་སྦྱར་བ་བྱས་ནས་ལངས། །
en: Then, Brahmā, Great Brahmā, arose, And with palms joined said:

source: ཚངས་པས་བཀྲུས་པ་དག་པ་པོ། །རིག་བྱེད་ཀུན་གྱི་ཕ་རོལ་ཕྱིན། །སྐྱེ་བོ་དགའ་མཛད་སྨན་པའི་རྗེ། །འཇིག་རྟེན་ཐམས་ཅད་གསོ་མཛད་པ། །
en: “Pristine One, purified by Brahmā, Master of all forms of knowledge, Delighter of beings, king of physicians, Healer of all worlds,

source: གནོད་སྦྱིན་སྲིན་པོ་གང་གི་རྣམས། །ཕྱོགས་དང་ཕྱོགས་མཚམས་གནས་པ་དང་། །ས་ཡི་འོག་དང་བར་དང་སྟེང་། །ནམ་མཁའ་དག་ལ་གནས་པའི་གདོན། །འཇིག་རྟེན་མགོན་གྱི་སྤྱན་སྔར་ནི། །དེ་དག་ཆད་པ་བདག་གིས་བཤད། །
en: “In the presence of the Lord of the World, I will pronounce the punishment For the yakṣas and rākṣasas That dwell throughout the cardinal and intermediate directions, And for the grahas that dwell Deep underground, on the earth, In between, and in the sky:

source: སྱཱད་ཡ་ཐེ་ད་ན། བྲཧྣེ། བྲཏྨ། གྷོ་ཥེ། བྲཧྨ་སྭ་རེ། བཛྲེ་བཛྲ་གྷོ་ཥེ། བཛྲ་དྷ་རེ། སྠི་ཏེ་སཱ་རེ། ཨ་ཙ་ལེ། ཨ་ར་ཎེ། ཨི་ཥ་ནི། ཨ་རཱ་ནི་ཏེ། ཤུ་རེ། བ་རཱ་གྲ། པྲཱཔྟེ། སཱ་ག་ར་བ་ཏེ། བདག་ཕྱོགས་ཐམས་ཅད་དུ་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: syād yathedam brahme brahma ghoṣe brahmasvare vajre vajraghoṣe vajradhare sthite sāre acale araṇe iṣaṇe arāṇete śūre varāgra prāpte sāgaravate | “ May I have well-being in all directions! Svāha

source: དེ་དག་གི་ནི་བརྩོན་འགྲུས་དང་། །གཟི་བརྗིད་དབང་ཕྱུག་སྟོབས་ཀྱིས་ཀྱང་། །ནད་རྣམས་ཐམས་ཅད་བཅོམ་པར་གྱུར། །བདག་འཇིགས་པ་དང་གནོད་པ་ཐམས་ཅད་ལས་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: “Through their vigor, Brilliance, majesty, and might, May all illnesses be vanquished And may I be safe From all perils and misfortunes! Svāhā

source: རླུང་ལས་གྱུར་དང་མཁྲིས་ལས་གྱུར། །བད་ཀན་ལས་གྱུར་འདུས་ལས་གྱུར། །ནད་རྣམས་ཐམས་ཅད་བཅོམ་པར་གྱུར། །བདག་འཇིགས་པ་དང་གནོད་པ་ཐམས་ཅད་ལས་དགེ་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: “May all illnesses from wind, bile, Phlegm, and their combination Be quelled, And may I be safe From all perils and misfortunes! Svāhā

source: དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: At this point, the Blessed One thought,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྒྱལ་སྲིད་གཅིག་གི་ཕྱིར་འཇིག་རྟེན་དུ་བྱུང་བ་མ་ཡིན།
en: “The blessed buddhas have not come into the world for the sake of a single kingdom.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། གྲོང་དང་། ཁྱིམ་ནས་སེམས་ཅན་གཅིག་གི་བར་གྱི་དོན་གྱི་ཕྱིར་འཇིག་རྟེན་དུ་བྱུང་བ་མ་ཡིན་གྱི།
en: The blessed buddhas have not come into the world for a single city, township, province, town, home, or being.

source: འཇིག་རྟེན་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་དོན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Rather, blessed buddhas have come into the world for the sake of the whole world, with its gods, Māra, and Brahmā; and for the sake of creatures, including mendicants and priests, gods, humans, and asuras

source: དེ་ནི་དཔེར་ན་སྨན་པ་མཁས་པའི་མཆོག་ཏུ་ཕྱིན་པ། གསོ་བ་ལ་བརྩོན་པ། སྨན་པས་ཤེས་པར་བྱ་བ་ཤིན་ཏུ་བསླབས་པ་རྒྱལ་པོ་གཅིག་གི་དོན་དུ་བྱུང་བ་མ་ཡིན། ཡུལ་གཅིག་གི་དོན་དུ་བྱུང་བ་མ་ཡིན་པ་ནས་སེམས་ཅན་གཅིག་གི་དོན་གྱི་བར་དུ་བྱུང་བ་མ་ཡིན་པ་དང་འདྲའོ། །
en: —in the same way that a master physician, a healer learned in the field of medicine, appears in the world neither for a single kingdom, nor for a single land or being.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཕྱོགས་གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་པའི་ཕྱོགས་དེ་དག་ཏུ་མི་རྣམས་དང་། མི་མ་ཡིན་པ་དེ་དག་ཀྱང་རྣམ་པར་འཚེ་བར་མི་བྱ་བར་སེམས་ཀྱིས།
en: Why so? It is thought that humans and non-humans could not be harmed wherever blessed buddhas were dwelling.

source: ང་ཡང་ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དེར་སོང་བ་དང་།
en: Thus, I too should venture out to the big city of Vaiśālī.
